import React from "react";
import working from "../assets/working.png"
import Navbar from "../components/Navbar";
import iasas from "../assets/icon.svg";
import Badge from "../components/Badge";
import EmptyCard from "../components/Card";
import mobile from "../assets/mobile.svg";
import Carousel from "../components/Carousel";
import ServicesCard from "../components/ServicesCard";
import image1 from "../assets/couple.png";
import image2 from "../assets/parents.png";
import image3 from "../assets/teen.png";
import image4 from "../assets/kids.png";
import image from "../assets/card.svg";
import FullBleedCarousel from "../components/FullBleedCarousel";
import CardWithImage from "../components/CardWithImage";
import Footer from "../components/Footer";
import Ellipse from "../assets/Ellipse.png";
import Ellipsee from "../assets/Ellipsee.png";
import pillar1 from '../assets/pillar1.png';
import pillar2 from '../assets/pillar2.png';
import pillar3 from '../assets/pillar3.png';
const Home = () => {
  const slides = [
    <CardWithImage
      title="عنوان"
      tagText="سيدات"
      image={working}
      color="bg-[#C63030]"
      text="لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي "
    ></CardWithImage>,
    <CardWithImage
      title="عنوان"
      tagText="كبار السن"
      image={working}
      color="bg-[#07A0A0]"
      text="لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي "
    ></CardWithImage>,
    <CardWithImage
      title="عنوان"
      tagText="آباء و وصاه"
      image={working}
      color="bg-[#DB7575]"
      text="لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي "
    ></CardWithImage>,
    <CardWithImage
      title="عنوان"
      tagText="معلمين"
      image={working}
      color="bg-[#C1A633]"
      text="لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي "
    ></CardWithImage>,
    <CardWithImage
      title="عنوان"
      tagText="شباب"
      image={working}
      color="bg-[#64508C]"
      text="لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي "
    ></CardWithImage>,
    <CardWithImage
      title="عنوان"
      tagText="اطفال"
      image={working}
      color="bg-[#78D5D7]"
      text="لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي "
    ></CardWithImage>,
  ];
  const items = [
    <EmptyCard image={mobile} text="الاستدراج" />,
    <EmptyCard image={mobile} text="الاستدراج" />,
    <EmptyCard image={mobile} text="الاستدراج" />,
    <EmptyCard image={mobile} text="إرسال محتوى جنسي" />,
    <EmptyCard image={mobile} text="إرسال محتوى جنسي" />,
    <EmptyCard image={mobile} text="التنمر الإلكتروني" />,
    <EmptyCard image={mobile} text="التنمر الإلكتروني" />,
    <EmptyCard image={mobile} text="هوس وسائل 
    التواصل الاجتماعي" />,
  ];

  return (
    <div className="left-0 right-0">
      <Navbar showLeftMenu={false} showRightMenu={false} />
      <div className="-z-20 ">
        <img src={Ellipse} className="-mt-96 w-full h-[600px] " />
      </div>
      <div className="relative">
        <img className="-mt-[400px] w-full h-[952px]" src={iasas} />
        <div className="absolute top-9 right-0 z-10 w-[96px] h-[491px] bg-secondary  text-black  rounded-l-3xl">
          <p className="text-[34px] leading-[48px] absolute top-64 right-3 text-white font-normal    -rotate-90">
            عنوان
          </p>
        </div>
        <div className="absolute flex flex-row items-center justify-center top-[470px]   right-0 w-[300px] h-[230px] bg-white  text-black  rounded-l-[44px]">
          <p className="text-[15px] mt-12 mr-3 right-3 w-[347px] leading-[30px]  text-right  text-[#666666] font-normal    ">
            لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو
            أيوسمود تيمبورو أيوسمود تيمبورو أيوسمود تيموم دولار سيت أنسيكتيتوروم
            دولار سيت أميت ,كونسيكتيتوربور نكايديديونتيوت لابوري ات دولار ماجنا
            أليكيويوت انيم أد مينيم فينايم,كيواس نوستريد أكسي{" "}
          </p>
        </div>
      </div>

      <div className="flex flex-col justify-start gap-y-4  w-full items-center mt-3">
        <div className="flex gap-x-5 flex-row-reverse items-center justify-center mb-5">
          <svg
            width="80"
            height="92"
            viewBox="0 0 80 92"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M11.2953 3.47784L40.0005 0L68.7057 3.47784C74.9436 3.47784 80.0002 8.53442 80.0002 14.7721V51.479C80.0002 73.5695 62.0925 91.4787 40.0005 91.4787C17.91 91.4787 0.000976562 73.5695 0.000976562 51.479V14.7721C0.000976562 8.53442 5.0575 3.47784 11.2953 3.47784Z"
              fill="#095EB2"
            />
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M64.9977 48.9373V38.5212C64.9924 35.3867 62.5134 32.8157 59.3813 32.6968C61.4698 30.8687 62.2057 27.936 61.2278 25.3381C60.2499 22.7397 57.7629 21.0205 54.9871 21.0232C52.2111 21.0254 49.7277 22.7495 48.7546 25.3499C47.7814 27.9495 48.5229 30.8804 50.6152 32.7046C48.962 32.7546 47.4106 33.5137 46.3571 34.7881C45.7285 34.5325 45.0601 34.3884 44.3817 34.3633C46.4757 32.5364 47.2167 29.6013 46.2409 27C45.2649 24.3977 42.7777 22.6741 39.9988 22.6741C37.2199 22.6741 34.7324 24.3977 33.757 27C32.7812 29.6013 33.5216 32.5364 35.6156 34.3633C34.9376 34.3884 34.2694 34.5325 33.6408 34.7881C32.5872 33.5137 31.0355 32.7546 29.3825 32.7046C31.4814 30.8794 32.2275 27.9431 31.254 25.3374C30.2805 22.7312 27.7925 21.0027 25.0105 21C22.2289 20.9973 19.7374 22.721 18.7593 25.3254C17.781 27.929 18.5209 30.8669 20.6165 32.6968C17.4844 32.8157 15.0054 35.3867 15 38.5212V48.9373C15 50.5481 16.3057 51.8543 17.9165 51.8543C18.0563 51.8486 18.1952 51.8347 18.3331 51.8123V63.9373C18.3363 66.0064 20.0134 67.6836 22.0829 67.6868C23.2223 67.6836 24.297 67.1587 24.9994 66.2622C25.7018 67.1587 26.7769 67.6836 27.916 67.6868C29.9857 67.6836 31.6625 66.0064 31.6658 63.9373V53.2288C32.0552 53.4192 32.4824 53.5188 32.9159 53.5208C33.0554 53.5156 33.1946 53.5017 33.3325 53.479V65.6035C33.3357 67.6733 35.0125 69.3501 37.0819 69.353C38.2213 69.3506 39.2962 68.8249 39.9988 67.9282C40.7012 68.825 41.7763 69.3506 42.9153 69.353C43.9666 69.3638 44.9699 68.9163 45.6653 68.1284C50.2521 72.1509 57.1651 71.9548 61.5158 67.678C65.8667 63.4014 66.1824 56.4932 62.2393 51.8379C63.7817 51.7534 64.9911 50.4822 64.9977 48.9373H64.9977ZM49.9983 27.6885C49.9983 24.9272 52.2368 22.6887 54.9982 22.6887C57.7594 22.6887 59.998 24.9272 59.998 27.6885C59.998 30.4499 57.7594 32.6885 54.9982 32.6885C52.2368 32.6885 49.9983 30.4499 49.9983 27.6885ZM34.9989 29.3552C34.9989 26.5942 37.2374 24.3557 39.9988 24.3557C42.7601 24.3557 44.9986 26.5942 44.9986 29.3552C44.9986 32.1165 42.7601 34.3545 39.9988 34.3545C37.2374 34.3545 34.9989 32.1165 34.9989 29.3552ZM19.9995 27.6885C19.9995 24.9272 22.2384 22.6887 24.9994 22.6887C27.7607 22.6887 29.9996 24.9272 29.9996 27.6885C29.9996 30.4499 27.7607 32.6885 24.9994 32.6885C23.6733 32.6885 22.4017 32.1614 21.4641 31.2241C20.5266 30.2861 19.9995 29.0149 19.9995 27.6885ZM29.9996 40.1882V63.9373C29.9996 65.0872 29.0668 66.02 27.916 66.02C26.7657 66.02 25.8329 65.0872 25.8329 63.9373V47.6877C25.8329 47.2275 25.4597 46.8542 24.9994 46.8542C24.539 46.8542 24.1662 47.2275 24.1662 47.6877V63.9373C24.1662 65.0872 23.2334 66.02 22.0829 66.02C20.9324 66.02 19.9995 65.0872 19.9995 63.9373V50.9707C20.5328 50.4282 20.8319 49.6982 20.833 48.9373V38.5212C20.833 38.0613 20.4601 37.6882 19.9995 37.6882C19.5395 37.6882 19.1666 38.0613 19.1666 38.5212V48.9373C19.1666 49.6277 18.6069 50.1873 17.9165 50.1873C17.2261 50.1873 16.6666 49.6277 16.6666 48.9373V38.5212C16.6666 36.2205 18.5317 34.3545 20.833 34.3545H29.1661C30.3058 34.352 31.3951 34.823 32.1743 35.6545C30.7983 36.7571 29.9982 38.4248 29.9996 40.1882V40.1882ZM42.9153 67.6868C41.7649 67.6868 40.832 66.7541 40.832 65.6035V49.3545C40.832 48.8945 40.4591 48.521 39.9988 48.521C39.5387 48.521 39.1655 48.8945 39.1655 49.3545V65.6035C39.1655 66.7541 38.2328 67.6868 37.0819 67.6868C35.9317 67.6868 34.9989 66.7541 34.9989 65.6035V52.6377C35.5322 52.0947 35.8313 51.3645 35.8324 50.6042V40.1882C35.8324 39.7273 35.4592 39.3547 34.9989 39.3547C34.5392 39.3547 34.1656 39.7273 34.1656 40.1882V50.6042C34.1656 51.2942 33.6061 51.8542 32.9159 51.8542C32.2253 51.8542 31.6658 51.2942 31.6658 50.6042V40.1882C31.6658 37.8867 33.5314 36.0215 35.8324 36.0215H44.1651C46.4664 36.0215 48.3318 37.8867 48.3318 40.1882V48.8293C47.4357 49.2573 46.5959 49.7949 45.8322 50.4287V40.1882C45.8322 39.7273 45.4587 39.3547 44.9986 39.3547C44.5386 39.3547 44.1651 39.7273 44.1651 40.1882V50.6042C44.1673 51.0222 44.2612 51.4346 44.4404 51.8123C40.7218 56.1782 40.7427 62.6038 44.4903 66.9453C44.106 67.4199 43.526 67.6929 42.9153 67.6868L42.9153 67.6868ZM63.3312 59.3533C63.3312 64.8762 58.854 69.353 53.3316 69.353C47.8091 69.353 43.3323 64.8762 43.3323 59.3533C43.3323 53.8313 47.8091 49.3545 53.3316 49.3545C58.8522 49.3591 63.3265 53.833 63.3312 59.3533ZM63.3312 48.9373C63.3312 49.6277 62.7716 50.1873 62.081 50.1873C61.3906 50.1873 60.8313 49.6277 60.8313 48.9373V38.5212C60.8313 38.0613 60.4584 37.6882 59.998 37.6882C59.5377 37.6882 59.1645 38.0613 59.1645 38.5212V48.9373C59.1645 49.0542 59.1898 49.1714 59.1979 49.2874C56.4203 47.6504 53.0853 47.2483 49.9983 48.1792V40.1882C49.9991 38.4248 49.199 36.7571 47.8235 35.6545C48.6024 34.823 49.6919 34.3521 50.8318 34.3545H59.1645C61.4658 34.3545 63.3312 36.2205 63.3312 38.5212L63.3312 48.9373Z"
              fill="white"
            />
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M58.2521 58.4146V56.7773C58.2521 54.7075 56.5743 53.0293 54.5043 53.0293C52.4342 53.0293 50.7565 54.7075 50.7565 56.7773V58.4146C49.8612 58.731 49.2611 59.5757 49.257 60.5249V65.023C49.257 66.2651 50.2638 67.2715 51.506 67.2715H57.5026C58.7443 67.2715 59.7511 66.2651 59.7511 65.023V60.5249C59.7472 59.5757 59.1473 58.731 58.2521 58.4146H58.2521ZM54.5043 54.5288C55.746 54.5288 56.7528 55.5357 56.7528 56.7774V58.2769H52.2552V56.7774C52.2552 55.5357 53.2621 54.5288 54.5043 54.5288ZM58.2521 65.023C58.2521 65.437 57.9164 65.772 57.5026 65.772H51.506C51.0917 65.772 50.7565 65.437 50.7565 65.023V60.5249C50.7565 60.1113 51.0917 59.7759 51.506 59.7759H57.5026C57.9164 59.7759 58.2521 60.1113 58.2521 60.5249V65.023Z"
              fill="white"
            />
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M53.3778 63.5245C53.7917 63.5245 54.1273 63.1889 54.1273 62.775C54.1273 62.361 53.7917 62.0254 53.3778 62.0254C52.9638 62.0254 52.6282 62.361 52.6282 62.775C52.6282 63.1889 52.9638 63.5245 53.3778 63.5245Z"
              fill="white"
            />
          </svg>

          <p className="  text-primary font-extrabold text-[35px] ">
            تعرف على ماذا نفعل
          </p>
        </div>

        <div className="flex flex-row items-center gap-x-20 justify-center mb-20">
          <Badge link="/pillarone" image={pillar1} title="التشبيك" text="لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمب ايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستري
أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس

أيوتي أرير " />
          <Badge link="/pillartwo" image={pillar2} title="تدريب" text="لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمب ايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستري
أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس

أيوتي أرير "  />
          <Badge link="/pillarthree" image={pillar3} title="معرفة" text="لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمب ايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستري
أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس

أيوتي أرير "/>
        </div>

        <div className="bg-[#F2F7FB] flex flex-col justify-center gap-y-4 items-center w-full h-[600px]">
          <div className="flex gap-x-5 flex-row-reverse items-center justify-center">
            <svg
              width="80"
              height="92"
              viewBox="0 0 80 92"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M11.2944 3.47785L39.9995 0L68.7051 3.47785C74.9429 3.47785 79.9995 8.53442 79.9995 14.7721V51.479C79.9995 73.5695 62.0918 91.4787 39.9995 91.4787C17.9094 91.4787 0 73.5695 0 51.479V14.7721C0 8.53442 5.05664 3.47785 11.2944 3.47785Z"
                fill="#095EB2"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M17.5 63.6667H62.5C63.8799 63.6667 65 62.5466 65 61.1665V29.5C65 28.1204 63.8799 27 62.5 27H17.5C16.1201 27 15 28.1204 15 29.5V61.1665C15 62.5466 16.1201 63.6667 17.5 63.6667ZM63.3334 37V61.1665C63.3334 61.6267 62.9598 62 62.5 62H17.5C17.04 62 16.6667 61.6267 16.6667 61.1665V37H63.3334ZM48.3334 57.8335C49.7134 57.8335 50.8333 56.7131 50.8333 55.3333C50.8333 54.8784 50.7117 54.4502 50.4983 54.0818C50.4933 54.0735 50.4883 54.0669 50.4833 54.0583L42.2366 40.8884C41.825 40.2317 40.9815 39.5002 39.9999 39.5002C39.0182 39.5002 38.1748 40.2317 37.7634 40.8884L29.5167 54.0583C29.5117 54.0669 29.5066 54.0735 29.5017 54.0818C29.2884 54.4502 29.1665 54.8784 29.1665 55.3333C29.1665 56.7131 30.2868 57.8335 31.6666 57.8335H48.3334ZM48.3334 56.167H31.6666C31.2065 56.167 30.8333 55.7937 30.8333 55.3332C30.8333 55.1916 30.8683 55.0583 30.9316 54.9419C30.9399 54.927 39.1765 41.7737 39.1765 41.7737C39.3365 41.5166 39.6183 41.167 39.9999 41.167C40.3817 41.167 40.6633 41.5166 40.8232 41.7737L49.0599 54.927C49.1282 55.0466 49.1666 55.1851 49.1666 55.3332C49.1666 55.7937 48.7932 56.167 48.3334 56.167H48.3334ZM40.8332 53.6667V52.8337C40.8332 52.3733 40.46 52.0002 39.9999 52.0002C39.5402 52.0002 39.1666 52.3733 39.1666 52.8337V53.6667C39.1666 54.127 39.5402 54.5002 39.9999 54.5002C40.46 54.5002 40.8332 54.127 40.8332 53.6667ZM40.8332 50.3335V45.3335C40.8332 44.873 40.46 44.5002 39.9999 44.5002C39.5402 44.5002 39.1666 44.873 39.1666 45.3335V50.3335C39.1666 50.7935 39.5402 51.1667 39.9999 51.1667C40.46 51.1667 40.8332 50.7935 40.8332 50.3335ZM63.3334 35.3337H16.6667V29.5C16.6667 29.04 17.04 28.667 17.5 28.667H62.5C62.9598 28.667 63.3334 29.04 63.3334 29.5L63.3334 35.3337ZM57.9883 32L56.91 33.0769C56.5848 33.4033 56.5848 33.9299 56.91 34.2568C57.2367 34.5818 57.7631 34.5818 58.09 34.2568L59.1666 33.1784L60.2432 34.2568C60.5699 34.5818 61.0967 34.5818 61.4233 34.2568C61.7484 33.9299 61.7484 33.4033 61.4233 33.0769L60.3449 32L61.4233 30.9236C61.7484 30.5971 61.7484 30.0703 61.4233 29.7436C61.0967 29.4184 60.57 29.4184 60.2432 29.7436L59.1666 30.8218L58.09 29.7436C57.7631 29.4184 57.2367 29.4184 56.91 29.7436C56.5848 30.0703 56.5848 30.5972 56.91 30.9236L57.9883 32ZM54.1666 31.1667H50.8333C50.3732 31.1667 49.9999 31.54 49.9999 32C49.9999 32.4602 50.3732 32.8335 50.8333 32.8335H54.1666C54.6266 32.8335 55 32.4602 55 32C55 31.54 54.6266 31.1667 54.1666 31.1667Z"
                fill="white"
              />
            </svg>

            <p className="  text-primary font-extrabold text-[35px] ">
              اهم المخاطر و التهديدات الألكترونية
            </p>
          </div>
          <Carousel items={items} />
        </div>

        <div className=" flex flex-col justify-center gap-y-4 items-center w-full mt-10 mb-10">
          <div className="flex gap-x-5 flex-row-reverse items-center justify-center mb-5">
            <svg
              width="81"
              height="92"
              viewBox="0 0 81 92"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M12.1055 3.47785L40.8105 0L69.5161 3.47785C75.7539 3.47785 80.8105 8.53442 80.8105 14.7721V51.479C80.8105 73.5695 62.9028 91.4787 40.8105 91.4787C18.7205 91.4787 0.811035 73.5695 0.811035 51.479V14.7721C0.811035 8.53442 5.86768 3.47785 12.1055 3.47785Z"
                fill="#095EB2"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M65.526 57.8743V57.8738L60.754 53.6038C60.4846 51.4448 59.7781 49.3911 58.6578 47.4883C58.5803 47.3487 58.5061 47.208 58.4259 47.0696C58.0788 46.4702 57.7002 45.8836 57.2586 45.3357C56.035 43.8164 54.377 42.6033 52.73 41.469C52.71 41.4553 52.6856 41.4395 52.6594 41.4229C52.6109 41.3765 52.5572 41.3333 52.496 41.2959C51.3458 40.596 50.1487 40.042 48.955 39.6458L42.6811 32.0493C42.548 31.8882 42.4297 31.7373 42.3149 31.5913C41.6375 30.7298 41.1022 30.0493 39.4381 29.6023L32.0451 27.6199C31.9096 27.5835 31.7735 27.5554 31.6374 27.5337L26.8575 23.2559C26.476 22.9146 25.8581 22.9148 25.4765 23.2559L16.098 31.6529C15.7169 31.9942 15.7166 32.5476 16.0977 32.8892L20.657 36.9729C19.9248 37.211 19.3227 37.6765 18.9501 38.2986C18.5497 38.9671 18.4638 39.7332 18.7072 40.4536C18.9499 41.176 19.4945 41.7713 20.2411 42.1294C20.6053 42.3047 20.9958 42.4112 21.3938 42.4509C21.2982 42.8945 21.323 43.3543 21.4727 43.7969C21.7152 44.5198 22.26 45.1155 23.0067 45.4739C23.3708 45.6492 23.7612 45.7556 24.1589 45.7952C24.0656 46.2295 24.0841 46.6897 24.2359 47.1421C24.6148 48.2615 25.7018 49.0169 26.9232 49.137C26.8278 49.5806 26.8518 50.0401 27.0008 50.4837C27.2433 51.2058 27.7876 51.8015 28.5336 52.1602C29.0025 52.3862 29.5146 52.5007 30.031 52.5007C30.3358 52.5007 30.6423 52.4607 30.9418 52.3801L33.9499 51.5676C34.1207 52.2722 34.1927 52.9653 34.1605 53.6355L34.033 56.1978L33.9665 57.604C33.9296 58.3574 34.2239 59.0801 34.7949 59.6394C35.3666 60.1987 36.1449 60.5252 36.9866 60.5581C37.0335 60.5598 37.0801 60.5608 37.1266 60.5608C37.602 60.5608 38.0554 60.4653 38.4628 60.2947C38.6036 60.6301 38.8165 60.9424 39.0964 61.2153C39.6684 61.7732 40.4468 62.0989 41.2884 62.1318C41.3354 62.1338 41.3823 62.1345 41.4289 62.1345C41.8957 62.1345 42.3492 62.0427 42.7637 61.8682C43.1958 62.9007 44.2844 63.6567 45.59 63.7078C45.6367 63.71 45.6835 63.7109 45.7302 63.7109C46.2058 63.7109 46.6592 63.6152 47.0666 63.4443C47.4994 64.4754 48.5872 65.2307 49.8917 65.282C49.9388 65.2835 49.9854 65.2844 50.0323 65.2844C50.6515 65.2844 51.2471 65.1228 51.7594 64.8203L54.7635 67.51C54.9543 67.6807 55.2043 67.7661 55.454 67.7661C55.7041 67.7661 55.9538 67.6807 56.1445 67.51L65.5258 59.1106C65.7089 58.9468 65.8121 58.7244 65.8121 58.4922C65.8122 58.2605 65.7092 58.0381 65.5261 57.8743L65.526 57.8743ZM29.4555 30.2722C29.5798 29.9009 29.8601 29.5948 30.2451 29.4092C30.6296 29.2237 31.0695 29.1829 31.484 29.2945L38.8773 31.2769C39.894 31.5503 40.1185 31.8357 40.718 32.5979C40.8336 32.7446 40.9644 32.9107 41.1105 33.0884L45.9879 38.9937C45.6445 38.9585 45.3041 38.9375 44.9701 38.9336H44.9692H44.9681C43.6312 38.9204 42.8596 38.4526 41.9024 37.5933L39.5435 35.4812C39.4169 35.3682 39.3037 35.2659 39.2008 35.1729C38.1309 34.2061 37.8933 34.0557 36.1721 33.5945L30.5487 32.0847C30.135 31.9744 29.7931 31.7241 29.5856 31.3799C29.3782 31.0357 29.3321 30.6416 29.4555 30.2722V30.2722ZM22.0853 40.6731C21.7774 40.7561 21.4501 40.7258 21.1637 40.5882C20.8776 40.4512 20.6697 40.2244 20.5771 39.9483C20.4843 39.6739 20.5177 39.3814 20.6712 39.1253C20.825 38.8684 21.0792 38.6812 21.3855 38.5979L25.6343 37.4531C25.748 37.4224 25.8647 37.407 25.9811 37.407C26.1788 37.407 26.3754 37.4512 26.556 37.5376C26.8418 37.6751 27.0497 37.9016 27.1426 38.1775C27.3358 38.749 26.9723 39.3552 26.3322 39.5288L22.0853 40.6731ZM24.8486 44.0171C24.5421 44.1001 24.2161 44.0701 23.9299 43.9331C23.6439 43.7954 23.4355 43.5686 23.3424 43.292C23.2497 43.0176 23.2829 42.7254 23.4362 42.4693C23.5899 42.2132 23.8433 42.0264 24.1505 41.9439C24.1581 41.9417 24.1651 41.939 24.1729 41.9368L26.8968 41.2024L26.8985 41.2022L28.3996 40.7962C29.0383 40.6243 29.7153 40.9497 29.9073 41.5213C30.098 42.0901 29.7425 42.6905 29.1137 42.867L26.3526 43.6126L24.8486 44.0171ZM27.6112 47.3604C26.9746 47.5327 26.2988 47.2078 26.1057 46.6372C25.9137 46.0647 26.2771 45.459 26.9168 45.2871L31.165 44.1397C31.2784 44.1092 31.3945 44.0943 31.5103 44.0943C31.7081 44.0943 31.905 44.1382 32.0858 44.2254C32.3719 44.3631 32.5805 44.5901 32.6727 44.8653C32.765 45.1402 32.7312 45.4326 32.5771 45.6892C32.4234 45.9456 32.1695 46.1321 31.8624 46.2146L31.8613 46.2151H31.8608L27.6112 47.3604ZM35.3427 49.0327C35.1887 49.2888 34.935 49.4754 34.6269 49.5581L30.3788 50.7056C30.0715 50.7883 29.7447 50.7581 29.458 50.6201C29.172 50.4824 28.9634 50.2551 28.8713 49.9805C28.7786 49.7049 28.8123 49.4116 28.9658 49.1553C29.119 48.8989 29.3721 48.7131 29.6786 48.6306C29.6859 48.6287 29.6929 48.6257 29.7003 48.6233L33.9277 47.4832C34.5669 47.3108 35.2446 47.6372 35.438 48.2085C35.5305 48.4837 35.4963 48.7764 35.3427 49.0327L35.3427 49.0327ZM51.6242 52.7805L51.4303 58.5374L51.2371 62.4993C51.223 62.7864 51.0835 63.053 50.8439 63.2495C50.6051 63.4458 50.2973 63.5476 49.9772 63.5349C49.31 63.5088 48.791 63.0015 48.8202 62.4043L48.8872 61.0283C48.8879 61.0193 48.889 61.0105 48.8894 61.0017C48.8895 60.9973 48.889 60.9932 48.889 60.9886L49.0137 58.4365C49.0374 57.9541 48.6196 57.5459 48.0808 57.5249C47.5433 57.5017 47.0862 57.878 47.0625 58.3599L46.9366 60.9378C46.8998 61.5288 46.341 61.9866 45.6753 61.9612C45.0081 61.9351 44.4891 61.428 44.5181 60.8308L44.5854 59.4544C44.586 59.4456 44.587 59.4368 44.5875 59.4278C44.5877 59.4236 44.5872 59.4192 44.5875 59.4151L44.7119 56.8631C44.7354 56.3804 44.3178 55.9722 43.779 55.9512C43.2424 55.928 42.784 56.304 42.7606 56.7864L42.6347 59.3648C42.6173 59.6463 42.4788 59.907 42.243 60.0999C42.0032 60.2964 41.6951 60.397 41.3737 60.3851C41.0526 60.3726 40.7548 60.2476 40.5351 60.033C40.3157 59.8189 40.2027 59.5432 40.2164 59.2569L40.2841 57.8731C40.2845 57.866 40.2853 57.8589 40.2857 57.8516C40.2859 57.8482 40.2855 57.845 40.2855 57.8414L40.4102 55.2864C40.4337 54.8042 40.016 54.396 39.4772 54.3746C38.9345 54.3526 38.4824 54.7276 38.459 55.2102L38.3332 57.7857C38.2981 58.378 37.7329 58.8365 37.0719 58.8111C36.7519 58.7986 36.455 58.6734 36.2358 58.4593C36.0166 58.2442 35.9035 57.9681 35.9176 57.6795L35.984 56.2735L36.1115 53.7122C36.154 52.8269 36.0517 51.9175 35.8092 50.9993C36.336 50.739 36.7699 50.3484 37.0626 49.8609C37.4633 49.1927 37.5506 48.4273 37.3075 47.7036C36.9293 46.5852 35.8429 45.8277 34.6202 45.7061C34.7157 45.2632 34.6913 44.8047 34.5429 44.3621C34.3004 43.6397 33.7561 43.044 33.0102 42.6851C32.6452 42.5095 32.254 42.4016 31.8549 42.3623C31.9475 41.9287 31.9289 41.47 31.7776 41.0188C31.5351 40.2964 30.9908 39.7007 30.2447 39.3418C29.8802 39.1663 29.4892 39.0584 29.0908 39.0191C29.1837 38.5843 29.1649 38.1245 29.012 37.6726C28.7696 36.9502 28.2249 36.355 27.4784 35.9969C26.733 35.6387 25.8784 35.5616 25.0717 35.7786L22.7755 36.3972L18.169 32.2713L26.1671 25.1109L29.2743 27.8911C28.4876 28.2835 27.8633 28.939 27.5841 29.771C27.3112 30.5891 27.4113 31.4556 27.8665 32.2105C28.3217 32.9661 29.0759 33.5166 29.989 33.7605L35.6114 35.27C36.9573 35.6309 36.9573 35.6309 37.8131 36.4038C37.9182 36.499 38.034 36.6035 38.1627 36.7185L40.5203 38.8294C41.5058 39.7144 42.7418 40.6607 44.9448 40.6826C46.9567 40.7056 49.2419 41.4336 51.3814 42.7324C51.5535 42.8472 51.7266 42.9622 51.909 43.0803C52.7321 43.6123 53.5094 44.26 54.2284 44.9036C54.2761 44.9463 54.419 45.0838 54.521 45.179C55.773 46.3862 56.7379 47.8721 57.5 49.364C57.9132 50.218 58.2398 51.1016 58.4744 52.0112C55.34 49.961 53.937 49.3699 52.8379 49.8396C51.7057 50.3235 51.6605 51.6861 51.6242 52.7805L51.6242 52.7805ZM55.4544 65.6553L52.9891 63.448C53.1051 63.1716 53.1734 62.8784 53.1882 62.5752L53.3823 58.6074C53.3824 58.6035 53.3826 58.5994 53.3826 58.5952L53.5764 52.833C53.6035 52.02 53.6672 51.6338 53.7291 51.4551C53.9164 51.4956 54.3361 51.6338 55.1706 52.0989C56.0301 52.5777 57.2034 53.3259 58.9484 54.5098C59.1001 54.6123 59.2439 54.7244 59.3781 54.8447L63.4545 58.4927L55.4544 65.6553Z"
                fill="white"
              />
            </svg>

            <p className="  text-primary font-extrabold text-[35px] ">
              تعرف على خدمات الدعم و المساندة
            </p>
          </div>
          <div className="flex items-center justify-center">
            <div className="grid  grid-cols-2 gap-16">
              <ServicesCard
              link="/eldery"
                ArrowColor="#07A0A0"
                color="bg-eldery"
                image={image1}
                title="كبار السن"
                text="لوريم ايبسوم دولار سيت أميت سيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم."
              />
              <ServicesCard
              link="/parents"
                ArrowColor="#DB7575"
                color="bg-parents"
                image={image2}
                title="استشارة الآباء"
                text="لوريم ايبسوم دولار سيت أميت سيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم."
              />
              <ServicesCard
                link="/youth"
                ArrowColor="#64508C"
                color="bg-[#64508C]"
                image={image3}
                title="شباب"
                text="لوريم ايبسوم دولار سيت أميت سيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم."
              />
              <ServicesCard
                ArrowColor="#78D5D7"
                color="bg-babyBlue"
                image={image4}
                title="امان الاطفال"
                text="لوريم ايبسوم دولار سيت أميت سيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم."
              />
            </div>
          </div>
        </div>

        <div className=" flex flex-col justify-center gap-y-4 items-center shadow-inner w-[1200px] mt-10 mb-10 ">
          <div className="flex gap-x-5 flex-row-reverse mt-5 items-center justify-center mb-5 overflow-x-hidden">
            <svg
              width="81"
              height="92"
              viewBox="0 0 81 92"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M11.9075 3.47785L40.6125 0L69.3181 3.47785C75.5559 3.47785 80.6125 8.53442 80.6125 14.7721V51.479C80.6125 73.5695 62.7048 91.4787 40.6125 91.4787C18.5225 91.4787 0.613037 73.5695 0.613037 51.479V14.7721C0.613037 8.53442 5.66968 3.47785 11.9075 3.47785Z"
                fill="#095EB2"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M22.3528 65.6523V63.1245H37.5178C37.983 63.1245 38.3603 62.7471 38.3603 62.2822C38.3603 61.8169 37.983 61.4394 37.5178 61.4394H18.1403C17.6751 61.4394 17.298 61.0622 17.298 60.5972V29.4248H56.0526V42.9045C56.0526 43.3699 56.4297 43.7473 56.8951 43.7473C57.3603 43.7473 57.7376 43.3699 57.7376 42.9045V33.6372H61.1074V41.2197C61.1074 41.6851 61.4847 42.0625 61.9499 42.0625C62.4153 42.0625 62.7924 41.6851 62.7924 41.2197V28.5825C62.7924 27.1865 61.6609 26.0549 60.2649 26.0549H57.7376V23.5276C57.7376 22.1316 56.6059 21 55.2101 21H18.1403C16.7445 21 15.613 22.1316 15.613 23.5276V60.5972C15.613 61.9929 16.7445 63.1245 18.1403 63.1245H20.6678V65.6523C20.6678 67.0479 21.7995 68.1794 23.1953 68.1794H43.4151C43.8805 68.1794 44.2576 67.8022 44.2576 67.3372C44.2576 66.8718 43.8805 66.4946 43.4151 66.4946H23.1953C22.7301 66.4946 22.3528 66.1172 22.3528 65.6523L22.3528 65.6523ZM60.2649 27.74C60.7303 27.74 61.1074 28.1169 61.1074 28.5825V31.9524H57.7376V27.74H60.2649ZM18.1403 22.6848H55.2101C55.6753 22.6848 56.0526 23.0623 56.0526 23.5276V27.74H17.298V23.5276C17.298 23.0623 17.6751 22.6848 18.1403 22.6848Z"
                fill="white"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M61.1074 65.6514C61.1074 66.1165 60.7303 66.4936 60.2649 66.4936H56.0526C55.5872 66.4936 55.2101 66.8711 55.2101 67.3364C55.2101 67.8013 55.5872 68.1787 56.0526 68.1787H60.2649C61.6609 68.1787 62.7924 67.0471 62.7924 65.6514V63.1235C62.7924 62.6582 62.4153 62.2812 61.9499 62.2812C61.4847 62.2812 61.1074 62.6582 61.1074 63.1235V65.6514Z"
                fill="white"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M21.5106 24.3691C21.976 24.3691 22.3531 24.7461 22.3531 25.2119C22.3531 25.6768 21.976 26.0542 21.5106 26.0542C21.0454 26.0542 20.6681 25.6768 20.6681 25.2119C20.6681 24.7461 21.0454 24.3691 21.5106 24.3691Z"
                fill="white"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M24.8806 24.3691C25.346 24.3691 25.7231 24.7461 25.7231 25.2119C25.7231 25.6768 25.346 26.0542 24.8806 26.0542C24.4154 26.0542 24.0381 25.6768 24.0381 25.2119C24.0381 24.7461 24.4154 24.3691 24.8806 24.3691Z"
                fill="white"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M28.2506 24.3691C28.7158 24.3691 29.093 24.7461 29.093 25.2119C29.093 25.6768 28.7158 26.0542 28.2506 26.0542C27.7852 26.0542 27.4081 25.6768 27.4081 25.2119C27.4081 24.7461 27.7852 24.3691 28.2506 24.3691Z"
                fill="white"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M34.0934 46.481C34.6638 46.481 35.1263 45.9939 35.1263 45.3928V34.5098C35.1263 33.9089 34.6638 33.4219 34.0934 33.4219H21.701C21.1306 33.4219 20.6681 33.9089 20.6681 34.5098V45.3928C20.6681 45.9939 21.1306 46.481 21.701 46.481H34.0934ZM23.5057 35.5981H32.2887C32.7151 35.5981 33.0607 35.9136 33.0607 36.3025V43.6001C33.0607 43.9893 32.7151 44.3045 32.2887 44.3045H23.5057C23.0794 44.3045 22.7337 43.9893 22.7337 43.6001V36.3025C22.7337 35.9136 23.0794 35.5981 23.5057 35.5981Z"
                fill="white"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M37.8026 32.7949H37.9279C38.3932 32.7949 38.7704 33.1721 38.7704 33.6375V33.7627C38.7704 34.228 38.3932 34.605 37.9279 34.605H37.8026C37.3373 34.605 36.9601 34.228 36.9601 33.7627V33.6375C36.9601 33.1721 37.3373 32.7949 37.8026 32.7949Z"
                fill="white"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M41.4225 32.7949H41.5479C42.0131 32.7949 42.3901 33.1721 42.3901 33.6375V33.7627C42.3901 34.228 42.0131 34.605 41.5479 34.605H41.4225C40.9572 34.605 40.5801 34.228 40.5801 33.7627V33.6375C40.5801 33.1721 40.9572 32.7949 41.4225 32.7949Z"
                fill="white"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M45.0436 32.7949H50.5995C51.0647 32.7949 51.442 33.1721 51.442 33.6375V33.7627C51.442 34.228 51.0647 34.605 50.5995 34.605H45.0436C44.5783 34.605 44.201 34.228 44.201 33.7627V33.6375C44.201 33.1721 44.5783 32.7949 45.0436 32.7949Z"
                fill="white"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M37.8026 36.416H50.5994C51.0646 36.416 51.442 36.793 51.442 37.2585V37.3835C51.442 37.8491 51.0646 38.2261 50.5994 38.2261H37.8026C37.3373 38.2261 36.9601 37.8491 36.9601 37.3835V37.2585C36.9601 36.793 37.3373 36.416 37.8026 36.416Z"
                fill="white"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M37.8026 40.0352H50.5994C51.0646 40.0352 51.442 40.4124 51.442 40.8777V41.0029C51.442 41.4683 51.0646 41.8452 50.5994 41.8452H37.8026C37.3373 41.8452 36.9601 41.4683 36.9601 41.0029V40.8777C36.9601 40.4124 37.3373 40.0352 37.8026 40.0352Z"
                fill="white"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M21.5106 49.6445H34.9906C35.4558 49.6445 35.8331 50.022 35.8331 50.4873C35.8331 50.9526 35.4558 51.3296 34.9906 51.3296H21.5106C21.0454 51.3296 20.6681 50.9526 20.6681 50.4873C20.6681 50.022 21.0454 49.6445 21.5106 49.6445Z"
                fill="white"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M21.5106 53.0156H34.9906C35.4558 53.0156 35.8331 53.3931 35.8331 53.8584C35.8331 54.3237 35.4558 54.7007 34.9906 54.7007H21.5106C21.0454 54.7007 20.6681 54.3237 20.6681 53.8584C20.6681 53.3931 21.0454 53.0156 21.5106 53.0156Z"
                fill="white"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M21.5106 56.3848H34.9906C35.4558 56.3848 35.8331 56.762 35.8331 57.2273C35.8331 57.6926 35.4558 58.0696 34.9906 58.0696H21.5106C21.0454 58.0696 20.6681 57.6926 20.6681 57.2273C20.6681 56.762 21.0454 56.3848 21.5106 56.3848Z"
                fill="white"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M50.8328 61.8312L57.2062 60.913C58.0068 61.7553 59.2807 61.9389 60.2864 61.3568C61.4949 60.6581 61.9094 59.1129 61.2131 57.9027L59.1068 54.2546C60.3166 53.5566 60.7317 52.0104 60.0336 50.8005C59.3357 49.5907 57.7893 49.1759 56.5794 49.8739L54.4733 46.226C53.7616 45.0251 52.2114 44.6281 51.0105 45.3398C50.0275 45.9223 49.5576 47.0917 49.864 48.1923L44.6523 54.8141L40.4146 57.2575C39.206 57.9562 38.7916 59.5019 39.4878 60.7116L41.1728 63.6298C41.8697 64.8395 43.4151 65.2548 44.6246 64.5583L44.627 64.5568L47.5758 69.6637C48.2727 70.8732 49.818 71.2887 51.0275 70.5922L51.03 70.5905L52.4891 69.7482C53.6986 69.0512 54.1141 67.5058 53.4173 66.2963L53.416 66.2939L50.8328 61.8312ZM58.5712 51.6459C58.8039 52.0482 58.6663 52.5634 58.2635 52.7963L57.421 51.3371C57.8238 51.1051 58.3385 51.2431 58.5712 51.6459ZM51.8616 46.7648C52.2642 46.5321 52.7795 46.6698 53.0124 47.0724L59.7522 58.747C59.997 59.1427 59.8748 59.6618 59.479 59.9066C59.0835 60.1513 58.5642 60.0292 58.3194 59.6335C58.3104 59.6191 58.302 59.6042 58.2939 59.5895L51.554 47.9152C51.3219 47.5124 51.4595 46.9979 51.8616 46.7648H51.8616ZM50.7166 49.8351L56.2121 59.3551L49.0264 60.39L46.227 55.5419L50.7166 49.8351ZM44.9033 56.6188L47.4308 60.9999L45.9717 61.8422L43.4442 57.4611L44.9033 56.6188ZM42.6286 62.7943L40.9436 59.8759C40.7111 59.473 40.8491 58.9579 41.2521 58.7248L41.9816 58.3036L44.5092 62.6847L43.7794 63.1059C43.3767 63.3353 42.8642 63.1957 42.6329 62.7943H42.6286ZM51.6433 68.2921L50.184 69.1349C49.7812 69.3676 49.2659 69.2296 49.0332 68.8266L46.0844 63.7191L48.8648 62.1188L49.0332 62.0939L51.9491 67.1449C52.1799 67.5461 52.0438 68.0585 51.6441 68.2922L51.6433 68.2921Z"
                fill="white"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M61.7973 48.8111L63.2565 47.9685C63.6594 47.7359 64.1747 47.8738 64.4075 48.2766C64.6399 48.6797 64.5019 49.1946 64.099 49.4273L62.6399 50.27C62.2369 50.5027 61.7216 50.3648 61.4889 49.9617C61.2564 49.5586 61.3944 49.0435 61.7973 48.8111Z"
                fill="white"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M58.49 46.4348L58.9795 44.6091C59.1 44.1594 59.562 43.8928 60.0113 44.0134H60.0116C60.4609 44.134 60.7278 44.5959 60.6072 45.0456L60.1177 46.8713C59.9972 47.3205 59.5353 47.5871 59.0857 47.467H59.0855C58.6361 47.3464 58.3695 46.8845 58.49 46.4348Z"
                fill="white"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M62.458 53.3023H62.4582C62.5786 52.8526 63.0407 52.5864 63.4901 52.7066L65.3158 53.1963C65.7652 53.3164 66.0317 53.7788 65.9112 54.2281V54.2285C65.7906 54.6778 65.3287 54.9444 64.8793 54.8238L63.0536 54.334C62.6043 54.2139 62.3376 53.752 62.458 53.3023Z"
                fill="white"
              />
            </svg>

            <p className="  text-primary font-extrabold text-[35px] ">
              اخر الفعاليات
            </p>
          </div>
          <div className="flex items-center p-10  shadow-inner shadow-inherit justify-center">
            <FullBleedCarousel items={slides} />
          </div>
        </div>
      </div>

      <div className="relative ">
        <div className="absolute flex flex-col space-y-6 text-black w-full h-full items-center justify-center ">
          <p className="  text-primary font-extrabold text-[35px] mb-9 ">
            القائمة السريعة
          </p>
          <div className="grid grid-cols-3 gap-16">
            <div className=" flex flex-row-reverse items-center justify-center gap-x-3">
              <svg
                width="75"
                height="82"
                viewBox="0 0 75 82"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g filter="url(#filter0_d_0_3154)">
                  <path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M16.9087 8.5092L37.6188 6L58.3292 8.5092C62.8297 8.5092 66.4779 12.1574 66.4779 16.6578V43.141C66.4779 59.0788 53.5577 72 37.6188 72C21.6813 72 8.76001 59.0788 8.76001 43.141V16.6578C8.76001 12.1574 12.4082 8.5092 16.9087 8.5092Z"
                    fill="white"
                  />
                </g>
                <defs>
                  <filter
                    id="filter0_d_0_3154"
                    x="0.76001"
                    y="0"
                    width="73.7179"
                    height="82"
                    filterUnits="userSpaceOnUse"
                    color-interpolation-filters="sRGB"
                  >
                    <feFlood flood-opacity="0" result="BackgroundImageFix" />
                    <feColorMatrix
                      in="SourceAlpha"
                      type="matrix"
                      values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                      result="hardAlpha"
                    />
                    <feOffset dy="2" />
                    <feGaussianBlur stdDeviation="4" />
                    <feColorMatrix
                      type="matrix"
                      values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.160784 0"
                    />
                    <feBlend
                      mode="normal"
                      in2="BackgroundImageFix"
                      result="effect1_dropShadow_0_3154"
                    />
                    <feBlend
                      mode="normal"
                      in="SourceGraphic"
                      in2="effect1_dropShadow_0_3154"
                      result="shape"
                    />
                  </filter>
                </defs>
              </svg>
              <svg
                width="2"
                height="46"
                viewBox="0 0 2 46"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M1.01025 0.677734V45.6777V0.677734Z"
                  stroke="#CECECE"
                />
              </svg>
              <p className="   text-[26px] font-normal leading-[48px] text-primary underline underline-offset-8 ">
                لوريم ابسم
              </p>
            </div>
            <div className=" flex flex-row-reverse items-center justify-center gap-x-3">
              <svg
                width="75"
                height="82"
                viewBox="0 0 75 82"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g filter="url(#filter0_d_0_3154)">
                  <path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M16.9087 8.5092L37.6188 6L58.3292 8.5092C62.8297 8.5092 66.4779 12.1574 66.4779 16.6578V43.141C66.4779 59.0788 53.5577 72 37.6188 72C21.6813 72 8.76001 59.0788 8.76001 43.141V16.6578C8.76001 12.1574 12.4082 8.5092 16.9087 8.5092Z"
                    fill="white"
                  />
                </g>
                <defs>
                  <filter
                    id="filter0_d_0_3154"
                    x="0.76001"
                    y="0"
                    width="73.7179"
                    height="82"
                    filterUnits="userSpaceOnUse"
                    color-interpolation-filters="sRGB"
                  >
                    <feFlood flood-opacity="0" result="BackgroundImageFix" />
                    <feColorMatrix
                      in="SourceAlpha"
                      type="matrix"
                      values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                      result="hardAlpha"
                    />
                    <feOffset dy="2" />
                    <feGaussianBlur stdDeviation="4" />
                    <feColorMatrix
                      type="matrix"
                      values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.160784 0"
                    />
                    <feBlend
                      mode="normal"
                      in2="BackgroundImageFix"
                      result="effect1_dropShadow_0_3154"
                    />
                    <feBlend
                      mode="normal"
                      in="SourceGraphic"
                      in2="effect1_dropShadow_0_3154"
                      result="shape"
                    />
                  </filter>
                </defs>
              </svg>
              <svg
                width="2"
                height="46"
                viewBox="0 0 2 46"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M1.01025 0.677734V45.6777V0.677734Z"
                  stroke="#CECECE"
                />
              </svg>
              <p className="   text-[26px] font-normal leading-[48px] text-primary underline underline-offset-8 ">
                لوريم ابسم
              </p>
            </div>
            <div className=" flex flex-row-reverse items-center justify-center gap-x-3">
              <svg
                width="75"
                height="82"
                viewBox="0 0 75 82"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g filter="url(#filter0_d_0_3154)">
                  <path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M16.9087 8.5092L37.6188 6L58.3292 8.5092C62.8297 8.5092 66.4779 12.1574 66.4779 16.6578V43.141C66.4779 59.0788 53.5577 72 37.6188 72C21.6813 72 8.76001 59.0788 8.76001 43.141V16.6578C8.76001 12.1574 12.4082 8.5092 16.9087 8.5092Z"
                    fill="white"
                  />
                </g>
                <defs>
                  <filter
                    id="filter0_d_0_3154"
                    x="0.76001"
                    y="0"
                    width="73.7179"
                    height="82"
                    filterUnits="userSpaceOnUse"
                    color-interpolation-filters="sRGB"
                  >
                    <feFlood flood-opacity="0" result="BackgroundImageFix" />
                    <feColorMatrix
                      in="SourceAlpha"
                      type="matrix"
                      values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                      result="hardAlpha"
                    />
                    <feOffset dy="2" />
                    <feGaussianBlur stdDeviation="4" />
                    <feColorMatrix
                      type="matrix"
                      values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.160784 0"
                    />
                    <feBlend
                      mode="normal"
                      in2="BackgroundImageFix"
                      result="effect1_dropShadow_0_3154"
                    />
                    <feBlend
                      mode="normal"
                      in="SourceGraphic"
                      in2="effect1_dropShadow_0_3154"
                      result="shape"
                    />
                  </filter>
                </defs>
              </svg>
              <svg
                width="2"
                height="46"
                viewBox="0 0 2 46"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M1.01025 0.677734V45.6777V0.677734Z"
                  stroke="#CECECE"
                />
              </svg>
              <p className="   text-[26px] font-normal leading-[48px] text-primary underline underline-offset-8 ">
                لوريم ابسم
              </p>
            </div>
            <div className=" flex flex-row-reverse items-center justify-center gap-x-3">
              <svg
                width="75"
                height="82"
                viewBox="0 0 75 82"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g filter="url(#filter0_d_0_3154)">
                  <path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M16.9087 8.5092L37.6188 6L58.3292 8.5092C62.8297 8.5092 66.4779 12.1574 66.4779 16.6578V43.141C66.4779 59.0788 53.5577 72 37.6188 72C21.6813 72 8.76001 59.0788 8.76001 43.141V16.6578C8.76001 12.1574 12.4082 8.5092 16.9087 8.5092Z"
                    fill="white"
                  />
                </g>
                <defs>
                  <filter
                    id="filter0_d_0_3154"
                    x="0.76001"
                    y="0"
                    width="73.7179"
                    height="82"
                    filterUnits="userSpaceOnUse"
                    color-interpolation-filters="sRGB"
                  >
                    <feFlood flood-opacity="0" result="BackgroundImageFix" />
                    <feColorMatrix
                      in="SourceAlpha"
                      type="matrix"
                      values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                      result="hardAlpha"
                    />
                    <feOffset dy="2" />
                    <feGaussianBlur stdDeviation="4" />
                    <feColorMatrix
                      type="matrix"
                      values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.160784 0"
                    />
                    <feBlend
                      mode="normal"
                      in2="BackgroundImageFix"
                      result="effect1_dropShadow_0_3154"
                    />
                    <feBlend
                      mode="normal"
                      in="SourceGraphic"
                      in2="effect1_dropShadow_0_3154"
                      result="shape"
                    />
                  </filter>
                </defs>
              </svg>
              <svg
                width="2"
                height="46"
                viewBox="0 0 2 46"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M1.01025 0.677734V45.6777V0.677734Z"
                  stroke="#CECECE"
                />
              </svg>
              <p className="   text-[26px] font-normal leading-[48px] text-primary underline underline-offset-8 ">
                لوريم ابسم
              </p>
            </div>
            <div className=" flex flex-row-reverse items-center justify-center gap-x-3">
              <svg
                width="75"
                height="82"
                viewBox="0 0 75 82"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g filter="url(#filter0_d_0_3154)">
                  <path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M16.9087 8.5092L37.6188 6L58.3292 8.5092C62.8297 8.5092 66.4779 12.1574 66.4779 16.6578V43.141C66.4779 59.0788 53.5577 72 37.6188 72C21.6813 72 8.76001 59.0788 8.76001 43.141V16.6578C8.76001 12.1574 12.4082 8.5092 16.9087 8.5092Z"
                    fill="white"
                  />
                </g>
                <defs>
                  <filter
                    id="filter0_d_0_3154"
                    x="0.76001"
                    y="0"
                    width="73.7179"
                    height="82"
                    filterUnits="userSpaceOnUse"
                    color-interpolation-filters="sRGB"
                  >
                    <feFlood flood-opacity="0" result="BackgroundImageFix" />
                    <feColorMatrix
                      in="SourceAlpha"
                      type="matrix"
                      values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                      result="hardAlpha"
                    />
                    <feOffset dy="2" />
                    <feGaussianBlur stdDeviation="4" />
                    <feColorMatrix
                      type="matrix"
                      values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.160784 0"
                    />
                    <feBlend
                      mode="normal"
                      in2="BackgroundImageFix"
                      result="effect1_dropShadow_0_3154"
                    />
                    <feBlend
                      mode="normal"
                      in="SourceGraphic"
                      in2="effect1_dropShadow_0_3154"
                      result="shape"
                    />
                  </filter>
                </defs>
              </svg>
              <svg
                width="2"
                height="46"
                viewBox="0 0 2 46"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M1.01025 0.677734V45.6777V0.677734Z"
                  stroke="#CECECE"
                />
              </svg>
              <p className="   text-[26px] font-normal leading-[48px] text-primary underline underline-offset-8 ">
                لوريم ابسم
              </p>
            </div>
            <div className=" flex flex-row-reverse items-center justify-center gap-x-3">
              <svg
                width="75"
                height="82"
                viewBox="0 0 75 82"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g filter="url(#filter0_d_0_3154)">
                  <path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M16.9087 8.5092L37.6188 6L58.3292 8.5092C62.8297 8.5092 66.4779 12.1574 66.4779 16.6578V43.141C66.4779 59.0788 53.5577 72 37.6188 72C21.6813 72 8.76001 59.0788 8.76001 43.141V16.6578C8.76001 12.1574 12.4082 8.5092 16.9087 8.5092Z"
                    fill="white"
                  />
                </g>
                <defs>
                  <filter
                    id="filter0_d_0_3154"
                    x="0.76001"
                    y="0"
                    width="73.7179"
                    height="82"
                    filterUnits="userSpaceOnUse"
                    color-interpolation-filters="sRGB"
                  >
                    <feFlood flood-opacity="0" result="BackgroundImageFix" />
                    <feColorMatrix
                      in="SourceAlpha"
                      type="matrix"
                      values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                      result="hardAlpha"
                    />
                    <feOffset dy="2" />
                    <feGaussianBlur stdDeviation="4" />
                    <feColorMatrix
                      type="matrix"
                      values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.160784 0"
                    />
                    <feBlend
                      mode="normal"
                      in2="BackgroundImageFix"
                      result="effect1_dropShadow_0_3154"
                    />
                    <feBlend
                      mode="normal"
                      in="SourceGraphic"
                      in2="effect1_dropShadow_0_3154"
                      result="shape"
                    />
                  </filter>
                </defs>
              </svg>
              <svg
                width="2"
                height="46"
                viewBox="0 0 2 46"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M1.01025 0.677734V45.6777V0.677734Z"
                  stroke="#CECECE"
                />
              </svg>
              <p className="   text-[26px] font-normal leading-[48px] text-primary underline underline-offset-8 ">
                لوريم ابسم
              </p>
            </div>
            <div className=" flex flex-row-reverse items-center justify-center gap-x-3">
              <svg
                width="75"
                height="82"
                viewBox="0 0 75 82"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g filter="url(#filter0_d_0_3154)">
                  <path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M16.9087 8.5092L37.6188 6L58.3292 8.5092C62.8297 8.5092 66.4779 12.1574 66.4779 16.6578V43.141C66.4779 59.0788 53.5577 72 37.6188 72C21.6813 72 8.76001 59.0788 8.76001 43.141V16.6578C8.76001 12.1574 12.4082 8.5092 16.9087 8.5092Z"
                    fill="white"
                  />
                </g>
                <defs>
                  <filter
                    id="filter0_d_0_3154"
                    x="0.76001"
                    y="0"
                    width="73.7179"
                    height="82"
                    filterUnits="userSpaceOnUse"
                    color-interpolation-filters="sRGB"
                  >
                    <feFlood flood-opacity="0" result="BackgroundImageFix" />
                    <feColorMatrix
                      in="SourceAlpha"
                      type="matrix"
                      values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                      result="hardAlpha"
                    />
                    <feOffset dy="2" />
                    <feGaussianBlur stdDeviation="4" />
                    <feColorMatrix
                      type="matrix"
                      values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.160784 0"
                    />
                    <feBlend
                      mode="normal"
                      in2="BackgroundImageFix"
                      result="effect1_dropShadow_0_3154"
                    />
                    <feBlend
                      mode="normal"
                      in="SourceGraphic"
                      in2="effect1_dropShadow_0_3154"
                      result="shape"
                    />
                  </filter>
                </defs>
              </svg>
              <svg
                width="2"
                height="46"
                viewBox="0 0 2 46"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M1.01025 0.677734V45.6777V0.677734Z"
                  stroke="#CECECE"
                />
              </svg>
              <p className="   text-[26px] font-normal leading-[48px] text-primary underline underline-offset-8 ">
                لوريم ابسم
              </p>
            </div>
            <div className=" flex flex-row-reverse items-center justify-center gap-x-3">
              <svg
                width="75"
                height="82"
                viewBox="0 0 75 82"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g filter="url(#filter0_d_0_3154)">
                  <path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M16.9087 8.5092L37.6188 6L58.3292 8.5092C62.8297 8.5092 66.4779 12.1574 66.4779 16.6578V43.141C66.4779 59.0788 53.5577 72 37.6188 72C21.6813 72 8.76001 59.0788 8.76001 43.141V16.6578C8.76001 12.1574 12.4082 8.5092 16.9087 8.5092Z"
                    fill="white"
                  />
                </g>
                <defs>
                  <filter
                    id="filter0_d_0_3154"
                    x="0.76001"
                    y="0"
                    width="73.7179"
                    height="82"
                    filterUnits="userSpaceOnUse"
                    color-interpolation-filters="sRGB"
                  >
                    <feFlood flood-opacity="0" result="BackgroundImageFix" />
                    <feColorMatrix
                      in="SourceAlpha"
                      type="matrix"
                      values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                      result="hardAlpha"
                    />
                    <feOffset dy="2" />
                    <feGaussianBlur stdDeviation="4" />
                    <feColorMatrix
                      type="matrix"
                      values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.160784 0"
                    />
                    <feBlend
                      mode="normal"
                      in2="BackgroundImageFix"
                      result="effect1_dropShadow_0_3154"
                    />
                    <feBlend
                      mode="normal"
                      in="SourceGraphic"
                      in2="effect1_dropShadow_0_3154"
                      result="shape"
                    />
                  </filter>
                </defs>
              </svg>
              <svg
                width="2"
                height="46"
                viewBox="0 0 2 46"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M1.01025 0.677734V45.6777V0.677734Z"
                  stroke="#CECECE"
                />
              </svg>
              <p className="   text-[26px] font-normal leading-[48px] text-primary underline underline-offset-8 ">
                لوريم ابسم
              </p>
            </div>
            <div className=" flex flex-row-reverse items-center justify-center gap-x-3">
              <svg
                width="75"
                height="82"
                viewBox="0 0 75 82"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g filter="url(#filter0_d_0_3154)">
                  <path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M16.9087 8.5092L37.6188 6L58.3292 8.5092C62.8297 8.5092 66.4779 12.1574 66.4779 16.6578V43.141C66.4779 59.0788 53.5577 72 37.6188 72C21.6813 72 8.76001 59.0788 8.76001 43.141V16.6578C8.76001 12.1574 12.4082 8.5092 16.9087 8.5092Z"
                    fill="white"
                  />
                </g>
                <defs>
                  <filter
                    id="filter0_d_0_3154"
                    x="0.76001"
                    y="0"
                    width="73.7179"
                    height="82"
                    filterUnits="userSpaceOnUse"
                    color-interpolation-filters="sRGB"
                  >
                    <feFlood flood-opacity="0" result="BackgroundImageFix" />
                    <feColorMatrix
                      in="SourceAlpha"
                      type="matrix"
                      values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                      result="hardAlpha"
                    />
                    <feOffset dy="2" />
                    <feGaussianBlur stdDeviation="4" />
                    <feColorMatrix
                      type="matrix"
                      values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.160784 0"
                    />
                    <feBlend
                      mode="normal"
                      in2="BackgroundImageFix"
                      result="effect1_dropShadow_0_3154"
                    />
                    <feBlend
                      mode="normal"
                      in="SourceGraphic"
                      in2="effect1_dropShadow_0_3154"
                      result="shape"
                    />
                  </filter>
                </defs>
              </svg>
              <svg
                width="2"
                height="46"
                viewBox="0 0 2 46"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M1.01025 0.677734V45.6777V0.677734Z"
                  stroke="#CECECE"
                />
              </svg>
              <p className="   text-[26px] font-normal leading-[48px] text-primary underline underline-offset-8 ">
                لوريم ابسم
              </p>
            </div>
          </div>
        </div>
        <div className="overflow-x-hidden">
          <img src={Ellipsee} className=" w-screen h-[635px] " />
        </div>
      </div>
      <Footer />
    </div>
  );
};

export default Home;
