import React from "react";
import Ellipse from "../assets/Ellipse.png";
import Navbar from "../components/Navbar";
import Footer from "../components/Footer";
import image from "../assets/parents.png";
import EmptyCard from "../components/Card";
import partner1 from "../assets/partner1.png";
import partner2 from "../assets/partner2.png";
import partner3 from "../assets/partner3.png";
import partner4 from "../assets/partner4.png";

const Partners = () => {
  const latestNews = [
    "لوريم ايبسوم دولار سيت يلس أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم. نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم.",
    "لوريم ايبسوم دولار سيت يلس أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم. نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم.",
    "لوريم ايبسوم دولار سيت يلس أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم. نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم.",
    "لوريم ايبسوم دولار سيت يلس أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم. نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم.",
  ];
  const items = [
    {
      index: 0,
      navigateTo: "/aboutUs",
      text: "نبذة عن المبادرة",
    },
    {
      index: 1,
      navigateTo: "/pillarsmain",
      text: "أليات تنفيذ المبادرة",
    },
    {
      index: 2,
      navigateTo: "/activities",
      text: "الأنشطة",
    },
    {
      index: 3,
      navigateTo: "/partners",
      text: "الشركاء",
    },
    {
      index: 4,
      navigateTo: "/outputs",
      text: "مخرجات المشروع",
    },
  ];
  return (
    <div className="left-0 right-0">
      <Navbar showRightMenu={true} items={items} index={3} />
      <div className="-z-20 ">
        <img src={Ellipse} className="-mt-[450px] relative w-full h-[600px] " />
      </div>
      <div className="flex flex-col items-center justify-center ml-[15%] mr-[15%]">
      <div className="flex flex-row items-center  gap-x-36   mb-10">
          <div className="flex flex-col items-center justify-center">
            <img className="w-[850px] rounded-3xl h-[450px]" src={image} />
          </div>

          <div className="flex flex-col items-end justify-end pr-12 w-[900px] ">
          <p className="  font-extrabold text-right text-[35px] text-primary ">
          الشركاء
        </p>
            <p className="  font-bold text-[22px] mb-6 text-right text-secondary ">
              مبادرة المواطنة الرقمية والحماية علي الانترنت{" "}
            </p>
            <p className="   font-normal mb-5 line-clamp-[8] leading-[41px] text-right text-[15px] text-[#666666] ">
            لوريم ايبسوم دولار سيت يلس أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم. نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم.
            </p>
          </div>
      </div>


      </div>

      <div className=" w-full bg-[#F2F7FB] pt-10 pb-6 ">
        <div className="flex items-end  justify-end ml-[15%] mr-[15%] pr-12 mb-10 ">
          <p className="  font-extrabold text-right text-[35px] text-primary ">
            الشركاء
          </p>
        </div>

        <div className="flex flex-col justify-center w-full items-center mt-16 ">
          <div className=" grid grid-cols-4 gap-y-14 gap-x-12">
            <EmptyCard shadow="drop-shadow-[0_5px_5px_rgba(9,94,178,0.3)]" text2="المجلس القومى للأمومة و الطفولة" image={partner1} />
            <EmptyCard shadow="drop-shadow-[0_5px_5px_rgba(9,94,178,0.3)]" text2="المجلس القومى للمرأه" image={partner2} />
            <EmptyCard shadow="drop-shadow-[0_5px_5px_rgba(9,94,178,0.3)]" text2="ITU"  image={partner3} />
            <EmptyCard shadow="drop-shadow-[0_5px_5px_rgba(9,94,178,0.3)]" text2="اليونيسيف"  image={partner4} />
            <EmptyCard shadow="drop-shadow-[0_5px_5px_rgba(9,94,178,0.3)]" text2="المجلس القومى للأمومة و الطفولة" image={partner1} />
            <EmptyCard shadow="drop-shadow-[0_5px_5px_rgba(9,94,178,0.3)]" text2="المجلس القومى للمرأه" image={partner2} />
            <EmptyCard shadow="drop-shadow-[0_5px_5px_rgba(9,94,178,0.3)]" text2="ITU"  image={partner3} />
            <EmptyCard shadow="drop-shadow-[0_5px_5px_rgba(9,94,178,0.3)]" text2="اليونيسيف"  image={partner4} />
          </div>
        </div>
      </div>
      <div className="flex items-end  justify-end ml-[15%] mr-[15%] pt-10  pb-10 ">
        <p className="  font-extrabold text-right text-[35px] text-primary ">
          اخر الاحداث
        </p>
      </div>

      <div className="flex flex-col justify-start  items-end  ml-[15%] mr-[15%] mb-10">
        {latestNews.map((item) => (
          <ul className="list-disc  rtl">
            <li className="marker-red pb-6">
              <p className="   font-normal line-clamp-2 text-[15px] leading-[41px] text-[#666666]">
                {item}
              </p>
            </li>
          </ul>
        ))}
      </div>
      <Footer />
    </div>
  );
};

export default Partners;
