import React from "react";
import Ellipse from "../assets/Ellipse.png";
import Navbar from "../components/Navbar";
import Footer from "../components/Footer";
import image from "../assets/Rectangle.png";
const SupportService = () => {

  const items = [
    {
      index: 0,
      navigateTo: "/guidelines",
      text: "الادلة الارشادية",
    },
    {
      index: 1,
      navigateTo: "/awarenessTools",
      text: "أدوات توعية تفاعلية",
    },
    {
      index: 2,
      navigateTo: "/courses",
      text: "كورسات تدريبية",
    },
    {
      index: 3,
      navigateTo: "/safetyguides",
      text: "ادلة واعي للأمان",
    },
    {
      index: 4,
      navigateTo: "/research",
      text: "الدراسات و الأبحاث",
    },
  ];
  const LeftSideMenuItems = [
    "لوريم ايبسوم دولار سيت يلس أميت ",
    "لوريم ايبسوم دولار سيت يلس أميت ",
    "لوريم ايبسوم دولار سيت يلس أميت ",
    "لوريم ايبسوم دولار سيت يلس أميت ",
    "لوريم ايبسوم دولار سيت يلس أميت ",
    "لوريم ايبسوم دولار سيت يلس أميت ",
    "لوريم ايبسوم دولار سيت يلس أميت ",
    "لوريم ايبسوم دولار سيت يلس أميت ",
    "لوريم ايبسوم دولار سيت يلس أميت ",
    "لوريم ايبسوم دولار سيت يلس أميت ",
    "لوريم ايبسوم دولار سيت يلس أميت ",
    "لوريم ايبسوم دولار سيت يلس أميت ",
    "لوريم ايبسوم دولار سيت يلس أميت ",
    "لوريم ايبسوم دولار سيت يلس أميت ",
    "لوريم ايبسوم دولار سيت يلس أميت ",
    "لوريم ايبسوم دولار سيت يلس أميت ",
  ];

  return (
    <div className="left-0 right-0">
      <Navbar  showRightMenu={true}  items={items} />
      <div className="-z-20 ">
        <img src={Ellipse} className="-mt-[450px] relative w-full h-[600px] " />
      </div>
     

      <div className="flex flex-row  items-end justify-end relative ml-[15%] mr-[17%] mb-10">
        <div className="w-[300px] shadow-md shadow-primary z-10 h-[100px] rounded-[35px] pl-3 text-[30px] font-extrabold outline outline-2 outline-primary text-primary flex items-center justify-start">
        Lorem ipsum
          </div>  
        <div className="w-[130px] absolute -top-6 -right-10 h-[150px] shadow-md shadow-[#095EB2]  flex items-center justify-center overflow-hidden custom-shape z-20">
       <img className="h-[175px] w-[150px]" src={image} />
         </div>
        </div>
      <div className="flex flex-col items-end gap-y-3 justify-end mb-10 ml-[10%] mr-[15%] ">
        
        <p className="   text-[35px] font-extrabold leadings-[48px] text-primary">
        المفهوم والتعريفات 
        </p>
        <p className="   text-right text-[15px] font-normal leadings-[41px] text-[#666666] ">
        لوريم ايبسوم دولار سيت يلس أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم. نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم. لوريم ايبسوم دولار سيت يلس أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم. نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم.
        </p>
        <p className="   text-right text-[35px] font-extrabold leadings-[48px] text-primary">
        عنوان
        </p>
        <p className="   text-right text-[15px] font-normal leadings-[41px] text-[#666666] ">
        لوريم ايبسوم دولار سيت يلس أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم. نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم. لوريم ايبسوم دولار سيت يلس أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم. نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم.
        </p>
        <p className="   text-right text-[15px] mt-10 font-normal leadings-[41px] text-[#666666] ">
        لوريم ايبسوم دولار سيت يلس أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم. نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم. لوريم ايبسوم دولار سيت يلس أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم. نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم.
        </p>
      </div>
      <Footer />
    </div>
  );
};

export default SupportService;
