import React, { useState } from "react";
import { useNavigate } from "react-router-dom";
import Ellipse from "../assets/EllipseYouth.png";
import Navbar from "../components/Navbar";
import Footer from "../components/Footer";
import teacher from "../assets/teacher.png";
import ImageTitleTextCard from "../components/ImageTitleTextCard";
import OneItemCarousel from "../components/OneItemCarousel";
import YouthSliderCard from "../components/YouthSliderCard";
import Ellipsee from "../assets/EllipseeTeens.png";
import EmptyCard from "../components/Card";
import CustomizedVideo from "../components/CustomizedVideo";
import video from '../assets/video.mp4';
import network from "../assets/network.png";
import InternetSupport from "../assets/InternetSupport.png";
import KidsSupport from "../assets/KidsSupport.png";
import WomenComplains from "../assets/WomenComplains.png";
const Teen = () => {
  const navigate = useNavigate();
  const list1 = [
    {
      image: network,
      title: "هوس وسائل التواصل الاجتماعي",
      text: "لوريم ايبسوم دولار سيت يلس أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتاتلوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم. نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم.",
    },
    {
      image: network,
      title: "هوس وسائل التواصل الاجتماعي",
      text: "لوريم ايبسوم دولار سيت يلس أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتاتلوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم. نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم.",
    },
    {
      image: network,
      title: "هوس وسائل التواصل الاجتماعي",
      text: "لوريم ايبسوم دولار سيت يلس أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتاتلوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم. نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم.",
    },
    {
      image: network,
      title: "هوس وسائل التواصل الاجتماعي",
      text: "لوريم ايبسوم دولار سيت يلس أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتاتلوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم. نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم.",
    },
    {
      image: network,
      title: "هوس وسائل التواصل الاجتماعي",
      text: "لوريم ايبسوم دولار سيت يلس أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتاتلوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم. نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم.",
    },
    {
      image: network,
      title: "هوس وسائل التواصل الاجتماعي",
      text: "لوريم ايبسوم دولار سيت يلس أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتاتلوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم. نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم.",
    },
    {
      image: network,
      title: "هوس وسائل التواصل الاجتماعي",
      text: "لوريم ايبسوم دولار سيت يلس أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتاتلوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم. نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم.",
    },
    {
      image: network,
      title: "هوس وسائل التواصل الاجتماعي",
      text: "لوريم ايبسوم دولار سيت يلس أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتاتلوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم. نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم.",
    },
    {
      image: network,
      title: "هوس وسائل التواصل الاجتماعي",
      text: "لوريم ايبسوم دولار سيت يلس أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتاتلوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم. نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم.",
    },
  ];

  const items = [
    { text: "لوريم ايبسوم دولار سيت يلس أميت " },
    { text: "لوريم ايبسوم دولار سيت يلس أميت " },
    { text: "لوريم ايبسوم دولار سيت يلس أميت " },
    { text: "لوريم ايبسوم دولار سيت يلس أميت " },
    { text: "لوريم ايبسوم دولار سيت يلس أميت " },
    { text: "لوريم ايبسوم دولار سيت يلس أميت " },
    { text: "لوريم ايبسوم دولار سيت يلس أميت " },
    { text: "لوريم ايبسوم دولار سيت يلس أميت " },
    { text: "لوريم ايبسوم دولار سيت يلس أميت " },
    { text: "لوريم ايبسوم دولار سيت يلس أميت " },
    { text: "لوريم ايبسوم دولار سيت يلس أميت " },
    { text: "لوريم ايبسوم دولار سيت يلس أميت " },
    { text: "لوريم ايبسوم دولار سيت يلس أميت " },
    { text: "لوريم ايبسوم دولار سيت يلس أميت " },
    { text: "لوريم ايبسوم دولار سيت يلس أميت " },
    { text: "لوريم ايبسوم دولار سيت يلس أميت " },
    { text: "لوريم ايبسوم دولار سيت يلس أميت " },
    { text: "لوريم ايبسوم دولار سيت يلس أميت " },
    { text: "لوريم ايبسوم دولار سيت يلس أميت " },
    { text: "لوريم ايبسوم دولار سيت يلس أميت " },
    { text: "لوريم ايبسوم دولار سيت يلس أميت " },
    { text: "لوريم ايبسوم دولار سيت يلس أميت " },
  ];

  const SliderItems = [
    <YouthSliderCard
      title="لورم ايبسوم"
      bgcolor="bg-[#64508C]"
      color="#64508C"
      image={teacher}
      text="لوريم ايبسوم دولار سيت أميت سيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم."
    />,
    <YouthSliderCard
      title="لورم ايبسوم"
      bgcolor="bg-[#64508C]"
      color="#64508C"
      image={teacher}
      text="لوريم ايبسوم دولار سيت أميت سيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم."
    />,
    <YouthSliderCard
      title="لورم ايبسوم"
      bgcolor="bg-[#64508C]"
      color="#64508C"
      image={teacher}
      text="لوريم ايبسوم دولار سيت أميت سيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم."
    />,
  ];
  return (
    <div className="left-0 right-0">
      <Navbar />
      <div className="-z-30 ">
        <img src={Ellipse} className="-mt-[450px] relative w-full h-[600px] " />
      </div>
      <div className="flex flex-col  items-end gap-y-3 justify-end mb-10 ml-[15%] mr-[18%] -mt-20 ">
        <p className="   text-[35px] font-extrabold leadings-[48px] text-primary">
          الشباب – الخطر
        </p>
      </div>
      <div className="flex flex-col items-center gap-y-3 justify-center mb-10 ml-[15%] mr-[15%] -mt-10 ">
        
        <div className="flex flex-row items-center gap-x-[70px] justify-between ">
          <div className="grid grid-cols-3 gap-x-[70px]  gap-y-12">
            {list1.map((item, index) => (
              <ImageTitleTextCard
                image={item.image}
                outlineColor=" hover:outline hover:outline-[#64508C] hover:outline-5 "
                key={index}
                color="#64508C"
                link="/riskyouth"
                shadow="drop-shadow-[0_5px_5px_rgba(100,80,140,0.301)]"
                title={item.title}
                text={item.text}
              />
            ))}
          </div>

          <div className="h-full rounded-tr-3xl p-10 rounded-tl-3xl rounded-bl-3xl col-span-1 flex flex-col items-end justify-start border-2 shadow-md shadow-[#64508C] backdrop-blur-sm border-[#64508C]">
            <p className="  text-right w-full text-primary text-[30px] font-bold leading-[48px]">
              جميع المخاطر
            </p>
            {items.map((item) => (
              <p className="  text-primary line-clamp-1 leading-[32px] font-normal text-[20px] text-right">
                {item.text}
              </p>
            ))}
          </div>
       
        </div>
        <div className="flex flex-col w-full   items-end gap-y-9 justify-end  ml-[15%] mr-[15%] shadow-[rgba(100,80,140,1)_0px_-10px_10px_-10px]  mt-20 mb-20 ">
          <p className="   text-[35px] font-extrabold leadings-[48px] text-primary mt-20">
          احداث ذات صلة
          </p>
          <div className="flex flex-col items-center justify-center w-full pl-[10%] pr-[10%]  ">
            <OneItemCarousel
            numberOfItems={1}
              ArrowColor="#64508C"
              ShowArrow={true}
              items={SliderItems}
            />
          </div>
        </div>

        <div className="flex flex-col w-full   items-end gap-y-9 justify-end  ml-[15%] mr-[15%] shadow-[rgba(100,80,140,1)_0px_-10px_10px_-10px]  mt-20 mb-20 ">
          <p className="   text-[35px] font-extrabold leadings-[48px] text-primary mt-20">
            شارك مع واعي
          </p>
          <div className="flex flex-row-reverse gap-x-40 ">
            <div className="flex flex-col  space-y-6  items-center justify-center h-full">
              <p className="   text-[15px]  font-normal leading-[41px] line-clamp-[5] text-[#64508C] text-right">
                لوريم ايبسوم دولار سيت يلس أميت ,كونسيكتيتور أدايبا يسكينج
                أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار
                ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير
                سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو
                كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت
                فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا
                باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بت نيولا
                باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتاتلوريم ايبسوم
                دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود
                تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم
                أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي
                يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار
                إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو
                فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات
                نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات
                نون بت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات
                نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم
                أيدي ايست لابوريوم. نون بت نيولا باراياتيور. أيكسسيبتيور ساينت
                أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا
                ديسيريونتموليت انيم أيدي ايست لابوريوم.{" "}
              </p>
            </div>
            <div>
              <CustomizedVideo shadow="drop-shadow-[10px_10px_10px_rgba(100,80,140,0.301)]" video={video} width='w-[550px]' color="#64508C" />
            </div>
          </div>
          <button
            onClick={() => navigate("/safetyguides")}
            className=" flex flex-row-reverse -mt-20 items-center justify-between relative group bg-[#64508C] w-[300px]   font-bold text-[30px] px-12 py-4 text-2xl rounded-full text-white overflow-hidden"
          >
            <span className="absolute inset-0  flex flex-row-reverse  items-center justify-between bg-white transition-transform   font-bold text-[30px] px-12 py-4  duration-700 text-[#64508C] rounded-full ease-in-out border-[#64508C] border-2  transform translate-x-full group-hover:translate-x-0">
              اعرف المزيد
              <svg
                width="36"
                height="22"
                viewBox="0 0 46 22"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M1.11233 9.69186C1.11285 9.69134 1.11329 9.69073 1.11391 9.69018L10.2824 0.565943C10.9693 -0.117587 12.0802 -0.115037 12.7639 0.571913C13.4476 1.25878 13.4449 2.36975 12.7581 3.05337L6.60234 9.17926H43.7626C44.7317 9.17926 45.5172 9.96478 45.5172 10.9339C45.5172 11.903 44.7317 12.6886 43.7626 12.6886H6.60243L12.758 18.8145C13.4448 19.4981 13.4475 20.6091 12.7639 21.2959C12.0802 21.983 10.9691 21.9853 10.2823 21.3019L1.11382 12.1776C1.11329 12.1771 1.11285 12.1765 1.11224 12.176C0.425015 11.4901 0.427215 10.3755 1.11233 9.69188V9.69186Z"
                  fill="#64508C"
                />
              </svg>
            </span>
            اعرف المزيد
            <svg
              width="36"
              height="22"
              viewBox="0 0 46 22"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M1.11233 9.69186C1.11285 9.69134 1.11329 9.69073 1.11391 9.69018L10.2824 0.565943C10.9693 -0.117587 12.0802 -0.115037 12.7639 0.571913C13.4476 1.25878 13.4449 2.36975 12.7581 3.05337L6.60234 9.17926H43.7626C44.7317 9.17926 45.5172 9.96478 45.5172 10.9339C45.5172 11.903 44.7317 12.6886 43.7626 12.6886H6.60243L12.758 18.8145C13.4448 19.4981 13.4475 20.6091 12.7639 21.2959C12.0802 21.983 10.9691 21.9853 10.2823 21.3019L1.11382 12.1776C1.11329 12.1771 1.11285 12.1765 1.11224 12.176C0.425015 11.4901 0.427215 10.3755 1.11233 9.69188V9.69186Z"
                fill="white"
              />
            </svg>
          </button>
        </div>
        </div>
        <div className="relative ">
        <div className="absolute flex flex-col space-y-6 text-black w-full h-full items-end justify-start pt-20 pr-[15%]  ">
          <p className="  text-primary font-extrabold text-[35px] mb-9 ">
          ابلغ عن خطر 
          </p>
          <div className="grid grid-cols-3 pl-56 pt-5 w-full ">
          <React.Fragment>
            <EmptyCard shadow="drop-shadow-[0_5px_5px_rgba(100,80,140,0.301)]" image={InternetSupport} text2="مباحث الانترنت " link='/contactus' />
            <EmptyCard shadow="drop-shadow-[0_5px_5px_rgba(100,80,140,0.301)]" image={WomenComplains} text2="مركز شكاوي المرأة " link='/contactus' />
            <EmptyCard shadow="drop-shadow-[0_5px_5px_rgba(100,80,140,0.301)]" image={KidsSupport} text2="خط نجدة الطفل" link='/contactus' />
              
              </React.Fragment>
         </div>
        </div>
        <div className="overflow-x-hidden">
          <img src={Ellipsee} className=" w-screen h-[635px] " />
        </div>
      </div>

      
      <Footer />
    </div>
  );
};

export default Teen;
